Revit 2027 API
ParameterTypeId.MepAnalyticalElecCurrentRating Property
 "Current Rating"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepAnalyticalElecCurrentRating { get; }
Public Shared ReadOnly Property MepAnalyticalElecCurrentRating As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepAnalyticalElecCurrentRating {
	ForgeTypeId^ get ();
}
static member MepAnalyticalElecCurrentRating : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace